app/views/project/show_task.html.erb


    <td><%= task_form.select :project_id, options_for_select(Project.all.map {|t| [ t.title, t.id]}, task_form.object.project_id), include_blank: "Search Project" %></td>
---
SELECT `projects`.* FROM `projects`

    <thead><tr bgcolor='skyblue'><th>Date</th><th>Task</th><th>Description</th><th>Duration</th></tr></thead>
    <tbody id="myTable"><% pro.tasks.each do |tas| %>
---
SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`project_id` = 1