app/controllers/callbacks_controller.rb

SELECT  `user_providers`.* FROM `user_providers` WHERE `user_providers`.`provider` = 'facebook' AND `user_providers`.`uid` = '1991220117794906' ORDER BY `user_providers`.`id` ASC LIMIT 1
---
  def facebook
    @user = UserProvider.find_for_oauth(request.env["omniauth.auth"])

SELECT  `user_providers`.* FROM `user_providers` WHERE `user_providers`.`provider` = 'google_oauth2' AND `user_providers`.`uid` = '114698035480304956876' ORDER BY `user_providers`.`id` ASC LIMIT 1
---
def google_oauth2
  @user = UserProvider.find_for_oauth(request.env["omniauth.auth"])