app/controllers/project_controller.rb

  def index
    @projects=Project.paginate(:page => params[:page], :per_page => 4)
---
SELECT  `projects`.* FROM `projects` LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `projects`

  def create
    @project=Project.new(project_params)
	  if @project.save
---
INSERT INTO `projects` (`title`, `desc`, `created_at`, `updated_at`) VALUES ('First', 'First Description', '2018-02-27 11:55:15', '2018-02-27 11:55:15')

  def edit
    @project = Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1

  def update
    @project = Project.find(params[:id])
	  if @project.update(project_params)
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
UPDATE `projects` SET `desc` = 'College Attendance\r\nManagement', `updated_at` = '2018-03-02 05:23:08' WHERE `projects`.`id` = 1

  def update_all_task
    @projects=Project.paginate(:page => params[:page], :per_page => 3)
        @date=params[:obj][:date]
        val=0
        count=0
        valid=0
        @tasks=params[:project][:tasks_attributes]
        @tasks.each do |i|
         j=@tasks[i]
          val+=j["dur"].to_i
          if j["title"].blank? || j["dur"].blank?
            valid+=1
          end
          count+=1
        end

    rem =8-Task.where(:date => @date).sum("dur")
---
SELECT  `projects`.`id` FROM `projects` WHERE (title = '%%') ORDER BY `projects`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `projects`
SELECT SUM(`tasks`.`dur`) FROM `tasks` WHERE `tasks`.`date` = '2018-03-03' HAVING (sum(dur) > 8 )

    else
      @tasks.each do |i|
      j=@tasks[i]
          @task=Task.create(
          :project_id => j["project_id"],
          :date => @date,
          :title => j["title"],
          :desc => j["desc"],
          :dur => j["dur"]
          )
---
INSERT INTO `tasks` (`project_id`, `date`, `title`, `desc`, `dur`, `created_at`, `updated_at`) VALUES (1, '2018-02-28', 'Dept Wise Attendance', 'Dept Wise ', 4.0, '2018-02-28 11:22:01', '2018-02-28 11:22:01')

  def show_task
    @task=Task.new
    @project= Project.new
    #@project.tasks.build
    @projects=Project.paginate(:page => params[:page], :per_page => 3)
---
SELECT  `projects`.* FROM `projects` LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `projects`

  def show
    @project = Project.find(params[:id])
    @task = Task.find_by_id params[:id]
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1

  def destroy
    @project = Project.find_by_id params[:id]
    @project.destroy
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 5 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 5